[
  {
    "id": 1,
    "title": "Operations Manager Associate (insurtech)",
    "description": "We are growing!\n Are you passionate about startups, technology, and transforming industries? Join us at Rommaana, an innovative Insurtech start-up on a mission to revolutionize the insurance industry. We are looking for an Operations Manager Associate who thrives in fast-paced environments and wants to help us change the rules of the game.\nIn this role, you will work directly with our CEO and Operations team, focusing on driving growth through creative strategies, proactive problem-solving, and building meaningful client relationships.\nWhy Rommaana?\n🖥️ Hybrid Work: Work from home or the office—the choice is yours.\n 💛 Inclusive Culture: Join a diverse team with an international mindset.\n 📈 Experienced Leadership: Learn from a founding team with experience at D360 Bank, Saudi Payments, Chubb, Tree and Microsoft 🚀 Career Growth: Be part of a company that offers opportunities to grow and take on more responsibility.\n 🌴 Team Bonding: Enjoy our  corporate event in Riyadh and Europe\nYour Responsibilities\nManage regulatory compliance and documentation.\nImprove and automate operational processes.\nManage daily insurance operations (policy issuance, cancellations, reporting).\nCoordinate with insurance carriers and partners.\nWhat We’re Looking For\nEducation: Bachelor’s or Master’s degree in Business, Computer Science, Telecommunications, or related fields from a top university.\nSkills: A proactive, self-starting attitude with exceptional organizational and time-management skills.\nExperience: Prior experience in insurance or education in insurance is required.\nPassion: Eagerness to work in a startup environment and a genuine interest in technology.\nLanguages:\nNative-level Arabic (essential for engaging key clients).\nAdvanced English (our primary working language).\nWhat’s in It for You?\nCompetitive salary: Get rewarded for your hard work.\nFlexibility: Enjoy flexible working hours and a hybrid work environment.\nOwnership: All full-time employees receive an ESOP share package, giving you a stake in Rommaana’s success (just like in Silicon Valley).\nGrowth Opportunities: Learn from industry leaders and take on impactful projects.\nTeam Events: Join us in riyadh  our annual summer corporate retreat",
    "skills": [],
    "responsibilities": [],
    "location": "Europe"
  },
  {
    "id": 2,
    "title": "Junior Software Engineer",
    "description": "At Rommaana Technologies we put our users first. We are looking for colleagues who remain learners throughout their careers and whose curiosity and motivation in understanding machine learning and insurtech will provide “game-changing” insurtech software and algorithms.\nJob Overview: We are seeking a passionate and talented Junior Software Engineer to join our dynamic team. In this role, you will assist in the design, development, and deployment of innovative software solutions. You will work closely with senior engineers and cross-functional teams to gain valuable experience and contribute to the success of our projects.\nLocation: [Remote / Hybrid / Office — Riyadh]\nType: Full-time\nTeam: Engineering\nExperience Level: Junior (1–3 years)\nAbout the Role\nWe’re looking for a Junior Backend Engineer to join our engineering team and help build reliable, scalable backend systems. You’ll work primarily with Python, Google Cloud Platform (GCP), Cloud Run, and PostgreSQL, and collaborate closely with senior engineers to design, build, and maintain production services.\nWe make heavy use of Claude Code and AI-assisted development workflows, so you’ll be expected to work effectively with AI coding tools to accelerate delivery while maintaining high engineering standards.\nThis is a great opportunity for someone early in their career who wants to learn modern cloud-native backend development in a fast-moving environment.\nWhat You’ll Do\nDevelop and maintain backend services using Python\nBuild and deploy containerized applications on GCP Cloud Run\nDesign and interact with PostgreSQL databases (queries, migrations, schema updates)\nWrite clean, maintainable, and well-tested code\nCollaborate with senior engineers on architecture and implementation decisions\nUse Claude Code and AI-assisted tools to speed up development, debugging, and refactoring\nMonitor application performance, troubleshoot issues, and fix bugs\nContribute to code reviews and engineering best practices\nLearn and improve continuously through mentorship and real production work",
    "skills": [],
    "responsibilities": [],
    "location": "Remote"
  },
  {
    "id": 3,
    "title": "Business Development / Operations CO-OP Trainee",
    "description": "We are growing!\n Are you passionate about startups, technology, and transforming industries? Join us at Rommaana, an innovative Insurtech start-up on a mission to revolutionize the insurance industry. We are looking for a Business Development / Operations Intern who thrives in fast-paced environments and wants to help us change the rules of the game.\nIn this role, you will work directly with our CEO and Sales & Operations team, focusing on driving growth through creative strategies, proactive problem-solving, and building meaningful client relationships.\nWhy Rommaana?\n🖥️ Hybrid Work: Work from home or the office—the choice is yours.\n 💛 Inclusive Culture: Join a diverse team with an international mindset.\n 📈 Experienced Leadership: Learn from a founding team with experience at D360 Bank, Saudi Payments, Chubb, Tree and Microsoft 🚀 Career Growth: Be part of a company that offers opportunities to grow and take on more responsibility.\n 🌴 Team Bonding: Enjoy our  corporate event in Riyadh and Europe\nYour Responsibilities\nCraft and refine proposals for B2B clients, partners, and government agencies.\nConduct market research to uncover new opportunities and support strategic initiatives under the CEO’s guidance.\nCreate and deliver compelling pitches, sales decks, and financial forecasts with the CEO and COO.\nCo-Lead Operations and Customer Success without B2B Clients and partners.\nRepresent Rommaana at industry events and network with key stakeholders.\nSchedule and participate in high-level business meetings with C-suite executives.\nWhat We’re Looking For\nEducation: Bachelor’s or Master’s degree in Business, Computer Science, Telecommunications, or related fields from a top university.\nSkills: A proactive, self-starting attitude with exceptional organizational and time-management skills.\nExperience: Prior experience in sales, business development, or startups is a plus (e.g., former entrepreneur or early employee).\nPassion: Eagerness to work in a startup environment and a genuine interest in technology.\nLanguages:\nNative-level Arabic (essential for engaging key clients).\nAdvanced English (our primary working language).\nWhat’s in It for You?\nCompetitive CO-OP Trainee Financial Aid: Get rewarded for your hard work. You have been enlisted in a Co-OP or trainer program at a Saudi University. You will get financial aid monthly. 4 months CO-OP training\nFlexibility: Enjoy flexible working hours and a hybrid work environment.\nOwnership: All full-time employees receive an ESOP share package, giving you a stake in Rommaana’s success (just like in Silicon Valley).\nGrowth Opportunities: Learn from industry leaders and take on impactful projects.\nTeam Events: Join us in Valencia, Spain for our annual summer corporate retreat!",
    "skills": [],
    "responsibilities": [],
    "location": "Europe"
  },
  {
    "id": 4,
    "title": "Product Designer  / Product Owner intern",
    "description": "We are growing!\n\n We are looking for creative minds who want to be part of an innovative and inclusive Insurtech start-up and help us reshape how insurance is designed and delivered.\n We have one open position for a Product Designer Intern to help us design seamless, user-friendly products that bridge the gap between complex insurance systems and intuitive customer experiences.\nWhy choose us?\n🖥️ Hybrid work: at home or in the office, the choice is yours.\n 💛 Diverse and inclusive environment with an international profile.\n 🎨 Work on high-impact projects shaping the future of insurance.\n 📈 Learn from a founding team with experience in Microsoft, Paribas Bank, Chubb Insurance\n 🚀 Opportunity to grow within the company.\nWhat will be your responsibilities?\nCollaborate with product managers and developers to design intuitive interfaces for our digital onboarding platform and embedded insurance solutions.\nCreate wireframes, prototypes, and high-fidelity designs for web and mobile applications.\nCollaborate with stakeholders to gather and document product requirements.\nDevelop and prioritize the product backlog, ensuring alignment with business goals.\nConduct user research and testing to understand customer pain points and refine designs accordingly.\nEnsure a consistent visual identity across all platforms by adhering to our brand guidelines.\nPresent your design concepts to stakeholders and iterate based on feedback.\nStay updated on design trends, tools, and best practices to bring fresh ideas to the team.\nWhat should you have?\nBachelor’s or Master’s degree in Design, Human-Computer Interaction, or related fields.\nExperience with design tools like Figma, Sketch, or Adobe Creative Suite.\nBasic understanding of user research, usability testing, and UX/UI design principles.\nA proactive attitude with a strong desire to learn and grow in a fast-paced startup environment.\nAn eye for detail and the ability to think both creatively and critically.\nPortfolio showcasing relevant design work (required).\nLanguages\nAdvanced or intermediate English with a willingness to learn.\nArabic native level (for understanding user needs in key markets).\nSpanish is a plus.\nWhat will you get in return?\nCompetitive academic financial aid\nFlexible working hours.\nAll full-time employees receive an ESOP share package from the company (like in Silicon Valley).\nSummer corporate event in Valencia, Spain.",
    "skills": [],
    "responsibilities": [],
    "location": "Riyadh (Hybrid)"
  },
  {
    "id": 5,
    "title": "Sales & Operations Trainee",
    "description": "We are growing!\n Are you passionate about startups, technology, and transforming industries? Join us at Rommaana, an innovative Insurtech start-up on a mission to revolutionise the insurance industry internationally. We are seeking a Sales & Operations Intern who excels in fast-paced environments and is eager to help us redefine the rules of the game.\nIn this role, you will work directly with our CEO and Sales & Operations team, focusing on driving growth through creative strategies, proactive problem-solving, and building meaningful client relationships.\nWhy Rommaana?\n🖥️ Hybrid Work: Work from home or the office—the choice is yours.\n 💛 Inclusive Culture: Join a diverse team with an international mindset with successful founders with international experience\n 📈 Experienced Leadership: Learn from a founding team with experience at  Microsoft, Paribas Bank, Chubb insurance  🚀 Career Growth: Be part of a company that offers opportunities to grow and take on more responsibility.\n 🌴 Team Bonding: Enjoy our  corporate event in Valencia and in our Middle East office\nYour Responsibilities\nCraft and refine proposals for B2B clients and international partners.\nCreate and deliver compelling pitches, sales decks, and financial forecasts with the CEO and COO.\nDevelop and implement operational strategies that enhance efficiency, strengthen cross-team coordination, and support scalable business expansion\nSchedule and participate in high-level business meetings with C-suite executives.\nWhat We’re Looking For\nEducation: Bachelor’s or Master’s degree in Business, Marketing & Digital Business\nSkills: A proactive, self-starting attitude with exceptional organisational and time-management skills.\nExperience: Prior experience in sales, business development, or startups is a plus (e.g., former entrepreneur or early employee).\nPassion: Eagerness to work in a startup environment and a genuine interest in technology.\nLanguages:\nAdvanced English (our primary working language)\nArabic (nice to have, our main clients are in the Middle East).\nWhat’s in It for You?\nCompetitive Trainee Financial Aid: You will get financial aid monthly. 5 months\nFlexibility: Enjoy flexible working hours and a hybrid work environment.\nOwnership: All full-time employees receive an ESOP share package, giving you a stake in Rommaana’s success (just like in Silicon Valley).\nGrowth Opportunities: Learn from industry leaders and take on impactful projects.\nTeam Events: Join us in Valencia, Spain for our annual summer corporate retreat!",
    "skills": [],
    "responsibilities": [],
    "location": "Riyadh (Hybrid)"
  },
  {
    "id": 6,
    "title": "Junior Software Engineer",
    "description": "At Rommaana Technologies we put our users first. We are looking for colleagues who remain learners throughout their careers and whose curiosity and motivation in understanding machine learning and insurtech will provide “game-changing” insurtech software and algorithms.\nJob Overview: We are seeking a passionate and talented Junior Software Engineer to join our dynamic team. In this role, you will assist in the design, development, and deployment of innovative software solutions. You will work closely with senior engineers and cross-functional teams to gain valuable experience and contribute to the success of our projects.",
    "skills": [],
    "responsibilities": [],
    "location": "Riyadh (Hybrid)"
  },
  {
    "id": 7,
    "title": "Senior Software Engineer",
    "description": "At Rommaana Technologies we put our users first. We are looking for colleagues who remain learners throughout their careers and whose curiosity and motivation in understanding machine learning and insurtech will provide “game-changing” insurtech software and algorithms.\nJob Overview: We are seeking a highly skilled and motivated Senior Software Engineer to join our dynamic team. In this role, you will lead the design, development, and deployment of cutting-edge software solutions. You will collaborate with cross-functional teams to deliver high-quality products and mentor junior developers to foster their growth and development.\nBACKUP\nResponsibilities\nDefine and implement best practices, code style guides, and various testing standards, including peer reviews and critiques\nUse your creative and innovation-driven ability to articulate engineering design patterns related to scale, performance, security, and usability\nDesign and development of Web products\nDemonstrate understanding of programming principles\nUndertake tough engineering challenges\nDesigning, implementing, and documenting APIs for use by other engineers\nTeaching and mentoring other engineers\nRobust understanding of Object Oriented Programming concepts and design\nAct as a client champion and use a long term perspective in client relations\nProvide technical leadership while taking a key part in strategic API, middle tier and database technology architectural and solution decision",
    "skills": [],
    "responsibilities": [],
    "location": "Riyadh (Hybrid)"
  }
]